# Pandas Assignment 3 (A)



### Step 1. Import the necessary libraries

In [3]:
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

### Step 2. Import the dataset

In [15]:
baby_names=pd.read_csv('Pandas Assignment 2A.csv')

### Step 3. Assign it to a variable called baby_names.

In [17]:
baby_names.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

### Step 4. See the first 10 entries

In [19]:
baby_names.head(11)

    Unnamed: 0     Id      Name  Year Gender State  Count
0        11349  11350      Emma  2004      F    AK     62
1        11350  11351   Madison  2004      F    AK     48
2        11351  11352    Hannah  2004      F    AK     46
3        11352  11353     Grace  2004      F    AK     44
4        11353  11354     Emily  2004      F    AK     41
5        11354  11355   Abigail  2004      F    AK     37
6        11355  11356    Olivia  2004      F    AK     33
7        11356  11357  Isabella  2004      F    AK     30
8        11357  11358    Alyssa  2004      F    AK     29
9        11358  11359    Sophia  2004      F    AK     28
10       11359  11360    Alexis  2004      F    AK     27

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [35]:
baby_names.drop(columns=['Unnamed: 0', 'Id'], axis=1, inplace=True, errors='ignore')
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Step 6. Is there more male or female names in the dataset?

In [39]:
gender_counts = baby_names['Gender'].value_counts()
gender_counts

Gender
F    558846
M    457549
Name: count, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [43]:
names = baby_names.groupby('Name')['Count'].sum()
names

Name
Aaban        12
Aadan        23
Aadarsh       5
Aaden      3426
Aadhav        6
           ...
Zyra         42
Zyrah        11
Zyren         6
Zyria        59
Zyriah       58
Name: Count, Length: 17632, dtype: int64

### Step 8. How many different names exist in the dataset?

In [47]:
num_unique_names = names.count()
num_unique_names

17632

### Step 9. What is the name with most occurrences?

In [53]:
most_common_name = names.idxmax()
most_common_name

'Jacob'

In [55]:
most_common_count = names.max()
most_common_count

242874

### Step 10. How many different names have the least occurrences?

In [61]:
least_common_count = names.min()
num_least_common = (names == 'least_common_count').sum()
least_common_count

5

### Step 11. What is the median name occurrence?

In [63]:
median_occurrence = names.median()
median_occurrence

49.0

### Step 12. What is the standard deviation of names?

In [65]:
std_dev_names = names.std()
std_dev_names

11006.069467891111

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [67]:
baby_names.describe()

               Year         Count
count  1.016395e+06  1.016395e+06
mean   2.009053e+03  3.485012e+01
std    3.138293e+00  9.739735e+01
min    2.004000e+03  5.000000e+00
25%    2.006000e+03  7.000000e+00
50%    2.009000e+03  1.100000e+01
75%    2.012000e+03  2.600000e+01
max    2.014000e+03  4.167000e+03